[
  {
    "Type": "Full Time",
    "Title": "Software Engineer",
    "Company": "Current Company",
    "Description": "## Developed an industry leading broadcast experience for providing customers fun and interactive ways to view available products\n### Developed six major releases over the course of six quarters following extensive stakeholder feedback.\n### Introduced cross-project standards and libraries for authentication and data syncing across distributed systems.\n### Executed the majority of releases as well as led post-release support by answering more than 80% of the 120 support requests generated from releases.\n### Designed and presented options to simplify 85% of the codebase using more generic, easily modifiable structures with reduced cyclomatic complexity.\n## Developed an internal inventory management tool to allow the organization to automate internal processes beyond the capabilities of excel and provide integrations with other products\n### Led the development team through 4 major releases as well as 75+ minor updates since the products launch in late May 2024 by responding to and handling 92% of the 180 support requests during and outside of business hours\n### Created backend systems for converting JSON requests to C member expressions for rapid development of server-sided dashboard content.\n### Created a basic data sync system to allow backend state to be immediately reflected in frontend displays and inputs as backend state changes.\n### Created a generic frontend dashboard filter system that handles autocompletes, display overrides, multiple input filters, and displaying filters in plain english in order to allow our development team to decouple our UI from MUI Datagrid.\n### Designed and implemented a system for storing, viewing, and calculating the edit history of a given entity and its children overtime.\n### Created middleware to automate the enrichment of logs, operation identity tracking, and time normalization.\n## Served as a team processes and technical lead as our development team doubled in size\n### Established clear coding standards by codifying rules around 50 code quality issues commonly disputed in PRs.\n### Established guidelines and expectations about the usage of agentic and AI assisted software development for the purpose of maintaining code quality.\n### Identified and planned the workloads of 3 new developers to insure a smooth integration over their first 3 months while maintaining team agility.\n### After noticing 25% of our meeting time with our first new develop was spent clarifying domain language and internal processes, created a domain accelerator to get developers up to speed rapidly. This resulted in a 2 hour presentation that preemptively taught domain language to the next batch of incoming developers,\n### Cataloged, grouped, and prioritized technical debt for approximately 75% of the active code base that predates codified quality standards.\n### Developed an internal standard for planning, presenting and discussing technically intense features.",
    "Skills": "Javascript, React, Node.js, Express, MongoDB, Git, Docker, AWS, Leadership, Technical Architecture",
    "StartDate": "January 2023",
    "EndDate": "Present",
    "Brief": "Led development of broadcast experience and inventory management tools while serving as technical lead for growing development team.",
    "Color": "blue",
    "meta": "fullstack frontend backend leadership react javascript node express C#"
  },
  {
    "Type": "Internship",
    "Title": "Software Engineer",
    "Company": "UKG",
    "Description": "## Improved data correction tools for developers and testers of UKG Ready by implementing form verification\n## Improved accessibility for keyboard users and screenreader users by improving focus styling for popup components and researching issues with screenreaders reading duplicating some headers \n## Performed user impact research for new features by writing SQL queries to verify how many customers had the required configurations to utilize new authentication features\n## Wrote tests for checklist and document upload components with Jest.",
    "Skills": "CSS, Java, Javascript, React, SQL, Git, Gitlab, Jira, Kibana",
    "StartDate": "January 2022",
    "EndDate": "August 2022",
    "Brief": "Enhanced UKG Ready's data tools and accessibility, and conducted research and testing for new features.",
    "Color": "blue",
    "meta": "fullstack frontend backend testing react javascript javac"
  },
  {
    "Type": "Internship",
    "Title": "Software Engineer",
    "Company": "Corning Incorporated",
    "Description": "## Developed process for refactoring machine learning projects using Keras to be run in the cloud via Databricks\n## Wrote documentation to describe how to use Databricks, AWS S3, AWS EC2 instances, and MLFlow\n## Validated process by refactoring an existing classification model to run in Databricks",
    "Skills": "AWS S3, AWS EC2, MLflow, Keras, Python, Databricks",
    "StartDate": "May 2021",
    "EndDate": "August 2021",
    "Brief": "Developed and validated a process for cloud-based machine learning using Databricks",
    "Color": "Blue",
    "meta": "ml cloud python"
  },
  {
    "Type": "Internship",
    "Title": "Software Engineer",
    "Company": "Simone Center",
    "Description": "## Designed and developed a virtual boardgame platform as a full stack Vue.js and Django\n## Trained 3 other engineers how to develop web applications with a Vue.js/Django stack\n## Conducted customer interviews and assisted with business model analysis",
    "Skills": "Javascript, CSS, HTML, Vue, Django Rest Framework, Git",
    "StartDate": "August 2020",
    "EndDate": "December 2020",
    "Brief": "Designed a virtual boardgame platform using Vue.js and Django, trained engineers, and contributed to business analysis.",
    "Color": "Blue",
    "meta": "fullstack frontend backend vue django"
  },
  {
    "Type": "Internship",
    "Title": "Software Engineer",
    "Company": "Corning Incorporated",
    "Description": "##Created a generative adversarial network using the python library Keras to assist with data generation for an on##going confidential project.",
    "Skills": "Python, Pytorch, Keras, Git",
    "StartDate": "July 2018",
    "EndDate": "August 2018",
    "Brief": "Created a generative adversarial network using the python library Keras to assist with data generation for an on##going confidential project.",
    "Color": "Blue",
    "meta": "ml python"
  },
  {
    "Type": "Internship",
    "Title": "Software Engineer",
    "Company": "Corning Incorporated",
    "Description": "##Created a webpage to assist with data driven server policies",
    "Skills": "Javascript, HTML, CSS, Gitlab",
    "StartDate": "July 2017",
    "EndDate": "August 2017",
    "Brief": "Created a webpage to assist with data driven server policies",
    "Color": "Blue",
    "meta": "frontend javascript"
  },
  {
    "Type": "Internship",
    "Title": "Software Engineer",
    "Company": "Erway Ambulance",
    "Description": "## Created a Java command line application to verify if a given employee is omitted from practicing medicine inthe United States\n## Refactored the app into a static webpage to provide users with a UI\n## Currently refactoring the app into a React/Express.js application",
    "Skills": "Java, React, Express, Javascript, HTML, CSS, Git",
    "StartDate": "January 2019",
    "EndDate": "December 2022",
    "Brief": "Iterativly developed an application to verify employee identities in a healthcare space",
    "Color": "Blue",
    "meta": "frontend javac react express javascript"
  }
]